Revit 2024 API
LinkNode Properties
The LinkNode type exposes the following members.
Properties
Name | Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from RenderNode.)
NodeName
 A readable name of the output node.
 (Inherited from RenderNode.)
SymbolId
 Identifies the Id of the symbol associated with the node.
See Also
LinkNode Class
Autodesk.Revit.DB Namespace